flyghost/OneOS-V2.1.0/drivers/hal/mm32/sdk/MM32F027XX_HAL/MM32F027x/Include/reg_rcc.h
#define RCC_APB2ENR_TIM16_Pos           (17)
#define RCC_APB2ENR_TIM16               (0x01U << RCC_APB2ENR_TIM16_Pos)        ///< TIM16 Timer clock enable
#define RCC_APB2ENR_TIM17_Pos           (18)
#define RCC_APB2ENR_TIM17               (0x01U << RCC_APB2ENR_TIM17_Pos)        ///< TIM17 Timer clock enable
#define RCC_APB2ENR_DBGMCU_Pos          (22)
#define RCC_APB2ENR_DBGMCU              (0x01U << RCC_APB2ENR_DBGMCU_Pos)       ///< DBGMCU clock enable
#define RCC_APB2ENR_EXTI_Pos            (29)
#define RCC_APB2ENR_EXTI                (0x01U << RCC_APB2ENR_EXTI_Pos)         ///< EXTI Block enable
#define RCC_APB2ENR_LPTIM1_Pos          (0)
#define RCC_APB2ENR_LPTIM1              (0x01U << RCC_APB2ENR_LPTIM1_Pos)       ///< LPTIM Block enable
#define RCC_APB2ENR_LPUART1_Pos         (0)
#define RCC_APB2ENR_LPUART1             (0x01U << RCC_APB2ENR_LPUART1_Pos)      ///< LPUART Block enable

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_APB1ENR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_APB1ENR_TIM2_Pos            (0)
#define RCC_APB1ENR_TIM2                (0x01U << RCC_APB1ENR_TIM2_Pos)         ///< Timer 2 clock enable

#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3                (0x01U << RCC_APB1ENR_TIM3_Pos)         ///< Timer 3 clock enabled
#define RCC_APB1ENR_TIM15_Pos           (9)
#define RCC_APB1ENR_TIM15               (0x01U << RCC_APB1ENR_TIM15_Pos)        ///< Timer 15 clock enabled




#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG                (0x01U << RCC_APB1ENR_WWDG_Pos)         ///< Window Watchdog clock enable


#define RCC_APB1ENR_SPI2_Pos            (14)
#define RCC_APB1ENR_SPI2                (0x01U << RCC_APB1ENR_SPI2_Pos)         ///< SPI 2 clock enable

#define RCC_APB1ENR_UART2_Pos           (17)
#define RCC_APB1ENR_UART2               (0x01U << RCC_APB1ENR_UART2_Pos)        ///< UART 2 clock enable
#define RCC_APB1ENR_UART3_Pos           (18)
#define RCC_APB1ENR_UART3               (0x01U << RCC_APB1ENR_UART3_Pos)        ///< UART 3 clock enable
#define RCC_APB1ENR_UART4_Pos           (19)
#define RCC_APB1ENR_UART4               (0x01U << RCC_APB1ENR_UART4_Pos)        ///< UART 4 clock enable

#define RCC_APB1ENR_I2C1_Pos            (21)
#define RCC_APB1ENR_I2C1                (0x01U << RCC_APB1ENR_I2C1_Pos)         ///< I2C 1 clock enable
#define RCC_APB1ENR_I2C2_Pos            (22)
#define RCC_APB1ENR_I2C2                (0x01U << RCC_APB1ENR_I2C2_Pos)         ///< I2C 2 clock enable

#define RCC_APB1ENR_USB_Pos             (23)
#define RCC_APB1ENR_USB                 (0x01U << RCC_APB1ENR_USB_Pos)          ///< USB clock enable
#define RCC_APB1ENR_BKP_Pos             (24)
#define RCC_APB1ENR_BKP                 (0x01U << RCC_APB1ENR_BKP_Pos)          ///< BKP clock enable


#define RCC_APB1ENR_CAN_Pos             (25)
#define RCC_APB1ENR_CAN                 (0x01U << RCC_APB1ENR_CAN_Pos)          ///< CAN clock enable
#define RCC_APB1ENR_CRS_Pos             (27)
#define RCC_APB1ENR_CRS                 (0x01U << RCC_APB1ENR_CRS_Pos)          ///< CRS interface clock enable



#define RCC_APB1ENR_PWR_Pos             (28)
#define RCC_APB1ENR_PWR                 (0x01U << RCC_APB1ENR_PWR_Pos)          ///< Power interface clock enable
#define RCC_APB1ENR_DAC_Pos             (29)
#define RCC_APB1ENR_DAC                 (0x01U << RCC_APB1ENR_DAC_Pos)          ///< DAC interface clock enable
#define RCC_APB1ENR_IWDG_Pos            (30)
#define RCC_APB1ENR_IWDG                (0x01U << RCC_APB1ENR_IWDG_Pos)          ///< IWDG interface clock enable
#define RCC_APB1ENR_RTC_Pos             (31)
#define RCC_APB1ENR_RTC                 (0x01U << RCC_APB1ENR_RTC_Pos)          ///< RTC interface clock enable



////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_BDCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_BDCR_LSEON_Pos              (0)
#define RCC_BDCR_LSEON                  (0x01U << RCC_BDCR_LSEON_Pos)           ///< External Low Speed oscillator enable
#define RCC_BDCR_LSERDY_Pos             (1)
#define RCC_BDCR_LSERDY                 (0x01U << RCC_BDCR_LSERDY_Pos)          ///< External Low Speed oscillator Ready
#define RCC_BDCR_LSEBYP_Pos             (2)
#define RCC_BDCR_LSEBYP                 (0x01U << RCC_BDCR_LSEBYP_Pos)          ///< External Low Speed oscillator Bypass

#define RCC_BDCR_RTCSEL_Pos             (8)
#define RCC_BDCR_RTCSEL                 (0x03U << RCC_BDCR_RTCSEL_Pos)          ///< RTCSEL[1:0] bits (RTC clock source selection)
#define RCC_BDCR_RTCSEL_LSE             (0x01U << RCC_BDCR_RTCSEL_Pos)          ///< LSE oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_LSI             (0x02U << RCC_BDCR_RTCSEL_Pos)          ///< LSI oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_HSE             (0x03U << RCC_BDCR_RTCSEL_Pos)          ///< HSE oscillator clock divided by 128 used as RTC clock

#define RCC_BDCR_RTCEN_Pos              (15)
#define RCC_BDCR_RTCEN                  (0x01U << RCC_BDCR_RTCEN_Pos)           ///< RTC clock enable
#define RCC_BDCR_BDRST_Pos              (16)
#define RCC_BDCR_BDRST                  (0x01U << RCC_BDCR_BDRST_Pos)           ///< Backup domain software reset
#define RCC_BDCR_DBP_Pos                (24)
#define RCC_BDCR_DBP                    (0x01U << RCC_BDCR_DBP_Pos)             ///< Allow access to RTC and backing registers


////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CSR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_CSR_LSION_Pos               (0)
#define RCC_CSR_LSION                   (0x01U << RCC_CSR_LSION_Pos)            ///< Internal Low Speed oscillator enable
#define RCC_CSR_LSIRDY_Pos              (1)
#define RCC_CSR_LSIRDY                  (0x01U << RCC_CSR_LSIRDY_Pos)           ///< Internal Low Speed oscillator Ready
#define RCC_CSR_LSI_LV_Pos              (5)
#define RCC_CSR_LSI_LV                  (0x01U << RCC_CSR_LSI_LV_Pos)           ///< The internal 40KHz oscillator is turned on
#define RCC_CSR_PVD_Pos                 (6)
#define RCC_CSR_PVD                     (0x01U << RCC_CSR_PVD_Pos)              ///< PVD reset enable
#define RCC_CSR_LOCK_Pos                (7)
#define RCC_CSR_LOCK                    (0x01U << RCC_CSR_LOCK_Pos)             ///< CPU LOCK reset enable
#define RCC_CSR_VDT_RSTN_Pos            (8)
#define RCC_CSR_VDT_RSTN                (0x01U << RCC_CSR_VDT_RSTN_Pos)         ///< VDT reset enable
#define RCC_CSR_VDTRSTF_Pos             (21)
#define RCC_CSR_VDTRSTF                 (0x01U << RCC_CSR_VDTRSTF_Pos)          ///< VDT reset flag
#define RCC_CSR_PVDRSTF_Pos             (22)
#define RCC_CSR_PVDRSTF                 (0x01U << RCC_CSR_PVDRSTF_Pos)          ///< PVD reset flag
#define RCC_CSR_LOCKUPF_Pos             (23)
#define RCC_CSR_LOCKUPF                 (0x01U << RCC_CSR_LOCKUPF_Pos)          ///< CPU lockup reset flag

