flyghost/OneOS-V2.1.0/drivers/hal/mm32/sdk/MM32F027XX_HAL/MM32F027x/Include/reg_rcc.h
#define RCC_CSR_RMVF_Pos                (24)
#define RCC_CSR_RMVF                    (0x01U << RCC_CSR_RMVF_Pos)             ///< Remove reset flag
#define RCC_CSR_PINRSTF_Pos             (26)
#define RCC_CSR_PINRSTF                 (0x01U << RCC_CSR_PINRSTF_Pos)          ///< PIN reset flag

#define RCC_CSR_PORRSTF_Pos             (27)
#define RCC_CSR_PORRSTF                 (0x01U << RCC_CSR_PORRSTF_Pos)          ///< POR/PDR reset flag

#define RCC_CSR_SFTRSTF_Pos             (28)
#define RCC_CSR_SFTRSTF                 (0x01U << RCC_CSR_SFTRSTF_Pos)          ///< Software Reset flag

#define RCC_CSR_IWDGRSTF_Pos            (29)
#define RCC_CSR_IWDGRSTF                (0x01U << RCC_CSR_IWDGRSTF_Pos)         ///< Independent Watchdog reset flag

#define RCC_CSR_WWDGRSTF_Pos            (30)
#define RCC_CSR_WWDGRSTF                (0x01U << RCC_CSR_WWDGRSTF_Pos)         ///< Window watchdog reset flag
#define RCC_CSR_LPWRRSTF_Pos            (31)
#define RCC_CSR_LPWRRSTF                (0x01U << RCC_CSR_LPWRRSTF_Pos)         ///< Low power reset flag

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_AHBRSTR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_AHBRSTR_DMA1_Pos            (0)
#define RCC_AHBRSTR_DMA1                (0x01U << RCC_AHBRSTR_DMA1_Pos)         ///< DMA clock reset
#define RCC_AHBRSTR_CRC_Pos             (6)
#define RCC_AHBRSTR_CRC                 (0x01U << RCC_AHBRSTR_CRC_Pos)          ///< Internal High Speed clock Calibration
#define RCC_AHBRSTR_GPIOA_Pos           (17)
#define RCC_AHBRSTR_GPIOA               (0x01U << RCC_AHBRSTR_GPIOA_Pos)        ///< GPIOA clock reset
#define RCC_AHBRSTR_GPIOB_Pos           (18)
#define RCC_AHBRSTR_GPIOB               (0x01U << RCC_AHBRSTR_GPIOB_Pos)        ///< GPIOB clock reset
#define RCC_AHBRSTR_GPIOC_Pos           (19)
#define RCC_AHBRSTR_GPIOC               (0x01U << RCC_AHBRSTR_GPIOC_Pos)        ///< GPIOC clock reset
#define RCC_AHBRSTR_GPIOD_Pos           (20)
#define RCC_AHBRSTR_GPIOD               (0x01U << RCC_AHBRSTR_GPIOD_Pos)        ///< GPIOD clock reset
#define RCC_AHBRSTR_GPIOE_Pos           (21)
#define RCC_AHBRSTR_GPIOE               (0x01U << RCC_AHBRSTR_GPIOE_Pos)        ///< GPIOE clock reset
#define RCC_AHBRSTR_GPIOF_Pos           (22)
#define RCC_AHBRSTR_GPIOF               (0x01U << RCC_AHBRSTR_GPIOF_Pos)        ///< GPIOF clock reset

#define RCC_AHBRSTR_HWDIV_Pos           (26)
#define RCC_AHBRSTR_HWDIV               (0x01U << RCC_AHBRSTR_HWDIV_Pos)        ///< HWDIV clock reset

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_CFGR2 Register Bit Definition
////////////////////////////////////////////////////////////////////////////////

#define RCC_CFGR2_AHB1_HV_Pos           (16)
#define RCC_CFGR2_AHB1_HV               (0x01U << RCC_CFGR2_AHB1_HV_Pos)        ///< APB1_HV output clock 2 frequency division
#define RCC_CFGR2_MCO_PRE_Pos           (20)
#define RCC_CFGR2_MCO_PRE_1             (0x00U << RCC_CFGR2_MCO_PRE_Pos)        ///< MCO 1 frequency division
#define RCC_CFGR2_MCO_PRE_2             (0x08U << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 2 frequency division
#define RCC_CFGR2_MCO_PRE_4             (0x09U << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 4   frequency division
#define RCC_CFGR2_MCO_PRE_8             (0x0AU << RCC_CFGR2_MCO_PRE_Pos)        ///< MCO 8   frequency division
#define RCC_CFGR2_MCO_PRE_16            (0x0BU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 16  frequency division
#define RCC_CFGR2_MCO_PRE_64            (0x0CU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 64  frequency division
#define RCC_CFGR2_MCO_PRE_128           (0x0DU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 128 frequency division
#define RCC_CFGR2_MCO_PRE_256           (0x0EU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 256 frequency division
#define RCC_CFGR2_MCO_PRE_512           (0x0FU << RCC_CFGR2_LPTIMSEL_Pos)       ///< MCO 512 frequency division

#define RCC_CFGR2_LPTIMSEL_Pos          (29)
#define RCC_CFGR2_LPTIMSEL_LSE          (0x00U << RCC_CFGR2_LPTIMSEL_Pos)       ///< LPTIM clock source select LSE
#define RCC_CFGR2_LPTIMSEL_LSI          (0x01U << RCC_CFGR2_LPTIMSEL_Pos)       ///< LPTIM clock source select LSI
#define RCC_CFGR2_LPTIMSEL_LP           (0x02U << RCC_CFGR2_LPTIMSEL_Pos)       ///< LPTIM clock source select LPTIMER
#define RCC_CFGR2_LPUARTSEL_Pos         (31)
#define RCC_CFGR2_LPUARTSEL             (0x01U << RCC_CFGR2_LPUARTSEL_Pos)      ///< LPUART clock source select LSI



////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_SYSCFG Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_SYSCFG_PROGCHECKEN_Pos      (0)
#define RCC_SYSCFG_PROGCHECKEN          (0x01U << RCC_SYSCFG_PROGCHECKEN_Pos)   ///< Whether to check the number in Flash when writing to Flash
#define RCC_CONFIG_PAGESIZE_Pos         (1)
#define RCC_CONFIG_PAGESIZE             (0x01U << RCC_CONFIG_PAGESIZE_Pos)      ///< Flash Page size
#define RCC_CONFIG_OSC_RTRIM_Pos        (8)
#define RCC_CONFIG_OSC_RTRIM            (0x03U << RCC_CONFIG_OSC_RTRIM_Pos)     ///< Oscillator feedback resistance trimming
#define RCC_CONFIG_OSC_LPFEN_Pos        (14)
#define RCC_CONFIG_OSC_LPFEN            (0x01U << RCC_CONFIG_OSC_LPFEN_Pos)     ///< Oscillator low pass filtering enable
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_HSIDLY Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_HSIDLY_Pos                  (0)
#define RCC_HSIDLY                      (0xFFU << RCC_HSIDLY_Pos)               ///< HSI delay count value 
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_HSEDLY Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_HSEDLY_Pos                  (0)
#define RCC_HSEDLY                      (0xFFFFU << RCC_HSEDLY_Pos)             ///< HSE delay count value 
////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_ICSCR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define RCC_ICSCR_TRIM_CRS_Pos          (1)
#define RCC_ICSCR_TRIM_CRS              (0x01U << RCC_ICSCR_TRIM_CRS_Pos)       ///< HSI TRIM value from CRS module 
#define RCC_ICSCR_HSICALSEL_Pos         (11)
#define RCC_ICSCR_HSICALSEL             (0x1FU << RCC_ICSCR_HSICALSEL_Pos)      ///< Select the value of register HSICAL 
#define RCC_ICSCR_HSICALSFT_Pos         (11)
#define RCC_ICSCR_HSICALSFT             (0x1FU << RCC_ICSCR_HSICALSFT_Pos)      ///< Select the value of register HSICAL 

////////////////////////////////////////////////////////////////////////////////
/// @brief RCC_PLLCFGR Register Bit Definition
////////////////////////////////////////////////////////////////////////////////


#define RCC_PLLCFGR_PLLSRC_Pos          (0)
#define RCC_PLLCFGR_PLLSRC              (0x01U << RCC_PLLCFGR_PLLSRC_Pos)       ///< HSE as PLL entry clock
#define RCC_PLLCFGR_PLLXTPRE_Pos        (1)
#define RCC_PLLCFGR_PLLXTPRE            (0x01U << RCC_PLLCFGR_PLLXTPRE_Pos)     ///< HSE frequency division for PLL entry
#define RCC_PLLCFGR_PLL_ICTRL_Pos       (2)
#define RCC_PLLCFGR_PLL_ICTRL_2_5       (0x00U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 2.5u
#define RCC_PLLCFGR_PLL_ICTRL_5         (0x01U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 5u
#define RCC_PLLCFGR_PLL_ICTRL_7_5       (0x02U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 7.5u
#define RCC_PLLCFGR_PLL_ICTRL_10        (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)    ///< PLL CP current control signals 10u
#define RCC_PLLCFGR_PLL_LDS_Pos         (4)
#define RCC_PLLCFGR_PLL_LDS             (0x01U << RCC_PLLCFGR_PLL_LDS_Pos)      ///< PLL LOCK DETECTOR ACCURACY SELECT
#define RCC_PLLCFGR_PLL_DP_Pos          (8)
#define RCC_PLLCFGR_PLL_DP              (0x07U << RCC_PLLCFGR_PLL_DP_Pos)       ///< PLL DP
#define RCC_PLLCFGR_PLL_DN_Pos          (16)
#define RCC_PLLCFGR_PLL_DN              (0xFFU << RCC_PLLCFGR_PLL_DN_Pos)       ///< PLL DN
#define RCC_PLLCFGR_PLL_DM_Pos          (29)
#define RCC_PLLCFGR_PLL_DM              (0x07U << RCC_PLLCFGR_PLL_DM_Pos)       ///< PLL DM

/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
